Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: A Relay is an aggregator of [data repos](#data-repo) from across the [Atmosphere](#atmosphere). They sync the repos from [PDSes](#pds) and produce a firehose of change events. [AppViews](#app-view) use a Relay to fetch user data.
ja: リレーは、[Atmosphere](#atmosphere)全体からの[データリポジトリ](#data-repo)の集約機能です。[PDS](#pds)からリポジトリを同期し、変更イベントのfirehoseを生成します。[AppView](#appview)はリレーを使用してユーザーデータを取得します。

source: A backup of the user's data could be persistently synced to a user's own device as a backup (contingent on the disk space available), or mirrored by a third-party service. In the event their PDS disappears without notice, the user should be able to migrate to a new provider by updating their DID Document and uploading their data backup.
ja: ユーザーデータのバックアップは、バックアップとしてクライアントに永続的に同期することができます（使用可能なディスク領域によって異なります）。PDSが予告なく消えた場合、ユーザーはDIDドキュメントを更新してバックアップをアップロードすることで、新しいプロバイダーに移行できます。

source: A backup of the user’s data could be persistently synced to a user's own device as a backup (contingent on the disk space available), or mirrored by a third-party service. In the event their PDS disappears without notice, the user should be able to migrate to a new provider by updating their DID Document and uploading their data backup.
ja: ユーザーデータのバックアップは、バックアップとしてクライアントに永続的に同期することができます（使用可能なディスク領域によって異なります）。PDSが予告なく消えた場合、ユーザーはDIDドキュメントを更新してバックアップをアップロードすることで、新しいプロバイダーに移行できます。

source: A collection of popular feeds you can find on Bluesky, including News, Booksky, Game Dev, Blacksky, and Fountain Pens
ja: News、Booksky、Game Dev、Blacksky、そしてFountain PensといったBlueskyで見つけることのできる人気のフィードのコレクション

source: A common pattern in API responses is to include “hydrated views” of data records. For example, when viewing an account’s profile, the response might include CDN or thumbnail URLs for any media files, moderation labels, global aggregations, and viewer-specific social graph context.
ja: APIレスポンスのよくあるパターンは、データレコードの「ハイドレートされたビュー」を含めることです。例えば、アカウントのプロフィールを表示する場合、レスポンスにはメディアファイルのCDNまたはサムネイルURL、モデレーションラベル、グローバルな集計値、およびビューア固有のソーシャルグラフコンテキストが含まれる場合があります。

source: A community feed: Compile a list of DIDs within that community and filter the firehose for all posts from users within that list.
ja: コミュニティフィード：そのコミュニティ内のDIDのリストをコンパイルし、そのリスト内のユーザーからのすべての投稿についてfirehoseをフィルタリングします。

source: A copy of the repository can be fetched as a CAR file from the old PDS using the public `com.atproto.sync.getRepo` endpoint. If the old PDS is inaccessible, a mirror might be available from a public relay, or a local backup might be available. If not, the new account will still function with the same identity, but old content would be missing.
ja: リポジトリのコピーは、旧PDSから認証不要の`com.atproto.sync.getRepo`エンドポイントを使ってCARファイルとして取得できます。旧PDSにアクセスできない場合、公開リレー上のミラーやローカルバックアップが利用できる場合があります。どちらも無い場合でも新しいアカウントは同じIDで動作しますが、移行前のコンテンツが欠落する可能性があります。

source: A data repository is a collection of data published by a single user. Repositories are self-authenticating data structures, meaning each update is signed and can be verified by anyone.
ja: データリポジトリは、単一のユーザーによって公開されたデータのコレクションです。リポジトリは自己認証データ構造であり、各更新は署名され、誰でも検証できます。

source: A global schemas network called [Lexicon](/specs/lexicon) is used to unify the names and behaviors of the calls across the servers. Servers implement "lexicons" to support featuresets, including the core `com.atproto.*` lexicons for syncing user repositories and the `app.bsky.*` lexicons to provide basic social behaviors.
ja: [Lexicon](/specs/lexicon)と呼ばれるグローバルスキーマネットワークは、サーバー間での呼び出しの名前と動作を統一するために使用されます。サーバーは、ユーザーリポジトリを同期するためのコア`com.atproto.*` Lexiconや、基本的なソーシャル動作を提供する`app.bsky.*` Lexiconなどの機能セットをサポートするためにLexiconを実装します。

source: A helpful pattern for application developers is to ensure there is an API endpoint that accepts a reference to a record (eg, a AT URI or equivalent; or multiple references) returns the hydrated data object(s).
ja: アプリケーション開発者にとって有用なパターンは、レコードへの参照（例：AT URIまたは同等のもの、および複数の参照）を受け入れるAPIエンドポイントがあり、ハイドレートされたデータオブジェクトを返すことです。

source: A label is published with the following information:
ja: ラベルは以下の情報と共に公開されます。

source: A network error occurred. Please check your internet connection
ja: ネットワークエラーが発生しました。インターネット接続を確認してください

source: A network error occurred. Please check your internet connection.
ja: ネットワークエラーが発生しました。インターネット接続を確認してください。

source: A new code has been sent
ja: 新しいコードが送信されました

source: A new form of verification
ja: 認証の新しい形

source: A screenshot of a post with a new button next to the share button that allows you to save the post to your bookmarks. The post is from @jcsalterego.bsky.social and reads "inventing a saturday that immediately follows monday".
ja: 共有ボタンの隣に投稿をブックマークに保存できるようにする新しいボタンがあるスクリーンショット。投稿は @jcsalterego.bsky.social によるもので、「月曜日に続く土曜日を発明中」と読めます。

source: A screenshot of a profile page with a bell icon next to the follow button, indicating the new activity notifications feature.
ja: プロフィールページのスクリーンショットには、フォローボタンの横にベルのアイコンが付いており、新しいアクティビティ通知機能を示します。

source: A topical feed: Filter the algorithm for posts and pass the post text through some filtering mechanism (an LLM, a keyword matcher, etc.) that filters for the topic of your choice.
ja: トピックフィード：アルゴリズムが返す投稿に対して、投稿本文をフィルタリングメカニズム（LLM、キーワードマッチャーなど）に渡して、選択したトピック用にフィルタリングします。

source: A user logs into our app using OAuth. In the process, they tell us which server hosts their data repository, _and_ they give us permission to read and write to it.
ja: ユーザーはOAuthを使用してアプリにログインします。その過程で、ユーザーはデータリポジトリをホストするサーバーを私たちに伝え、*そして*それを読み書きする権限を私たちに与えます。

source: A user may choose to hide, warn, or ignore each label from a labeler. Hiding and warning are basically similar, except that hide will also filter the labeled content from feeds and listings. Ignore just ignores the label. If adult content is not enabled in preferences, the behavior should force to hide with no override.
ja: ユーザーは、ラベラーからの各ラベルを非表示（hide）、警告（warn）、または無視（ignore）することを選択できます。非表示と警告は基本的に似ていますが、非表示はラベル付きコンテンツをフィードや一覧表示からフィルタリングします。無視はラベルを無視するだけです。環境設定でアダルトコンテンツが有効になっていない場合、挙動は上書き不可で非表示を強制する必要があります。

source: A user requests a feed from the AppView using the at-uri of the declared feed
ja: 宣言されたフィードのat-uriを使用してユーザーがAppViewからフィードをリクエストします

source: A “commit” to a data repository is simply a keypair signature over a Root node’s CID. Each mutation to the repository produces a new Commit node.
ja: データリポジトリへの「コミット」は、ルートノードのCIDに対する鍵ペア署名にすぎません。リポジトリが変更されるたびに、新しいコミットノードが生成されます。

source: API endpoints should always specify an `output` with `encoding`, even if they have no meaningful response data
ja: APIエンドポイントは、意味のあるレスポンスデータがない場合でも、常に`encoding`付きの`output`を指定すべきです

source: API endpoints which take an account identifier as an argument (eg, query parameter) should use `at-identifier` so that clients can avoid calling `resolveHandle` if they only have an account handle
ja: アカウント識別子を引数（例：クエリパラメータ）として受け取るAPIエンドポイントは、ハンドルしかない場合でもクライアントが`resolveHandle`を呼び出さなくていいように、`at-identifier`を使用するべきです

source: API error names: `UpperCamelCase`
ja: APIエラー名：`UpperCamelCase`

source: AT Protocol (or atproto) is a protocol for creating decentralized social applications. {{className: 'lead'}}
ja: ATプロトコル（またはatproto）は、分散型ソーシャルアプリケーションを作成するためのプロトコルです。 {{className: 'lead'}}

source: AT Protocol OAuth has a special carveout for local development. The `client_id` must be `localhost` and the `redirect_uri` must be on host 127.0.0.1. Read more in the [Localhost Client Development specs](/specs/oauth#localhost-client-development).
ja: ATプロトコルOAuthにはローカル開発向けの特例があります。`client_id`は`localhost`、`redirect_uri`のホストは127.0.0.1である必要があります。詳細は仕様の[Localhost Client Development](/specs/oauth#localhost-client-development)を参照してください。

source: AT Protocol builds on the philosophy of the web with the technology of peer-to-peer protocols and the practices of data-intensive distributed systems.
ja: ATプロトコルは、ウェブの哲学を土台に、P2Pプロトコルの技術とデータ指向分散システムの実践を組み合わせて構築されています。

source: AT Protocol is the tech developed at [Bluesky](https://bsky.app) for open social networking. In this article we're going to explore AT Proto from the perspective of distributed backend engineering. {{className: 'lead'}}
ja: ATプロトコルは、オープンソーシャルネットワーキング向けに[Bluesky](https://bsky.app)で開発された技術です。この記事では、分散バックエンドエンジニアリングの観点からATプロトコルについて説明します。{{className: 'lead'}}

source: AT Protocol records are public...
ja: ATプロトコルのレコードは公開情報です。

source: AT Protocol's model is that _speech_ and _reach_ should be two separate layers, built to work with each other. The “speech” layer should remain permissive, distributing authority and designed to ensure everyone has a voice. The “reach” layer lives on top, built for flexibility and designed to scale.
ja: ATプロトコルのモデルでは、*スピーチ*と*リーチ*は2つの別々のレイヤーとして構築され、は別個の層として設計され、相互に連携して動作します。スピーチ層は寛容で権限を分散し、誰もが発言できることを重視します。リーチ層はその上に位置し、柔軟性とスケーラビリティのために設計されています。

source: AT syncs repositories in a federated networking model. Federation ensures the network is convenient to use and reliably available. Repository data is synchronized between servers over standard web technologies (HTTP and WebSockets).
ja: ATはフェデレーションネットワークモデルでリポジトリを同期します。フェデレーションにより、ネットワークが使いやすく、確実に利用できることが保証されます。リポジトリデータは、標準のウェブテクノロジー（HTTPおよびWebSocket）を介してサーバー間で同期されます。

source: ATProto [specifies](/specs/oauth) a particular "profile" of the OAuth standards, using [OAuth 2.1](https://www.ietf.org/archive/id/draft-ietf-oauth-v2-1-13.html) as the foundation.
ja: ATプロトコルは[OAuth仕様](/specs/oauth)でOAuth標準の特定の「プロファイル」を指定し、[OAuth 2.1](https://www.ietf.org/archive/id/draft-ietf-oauth-v2-1-13.html)を基礎としています。

source: About
ja: このアプリについて

source: Abusive or discriminatory behavior
ja: 虐待または差別的な行動

source: Accept
ja: 承認

source: Accept Request
ja: リクエストを承認

source: Accept chat request
ja: チャットのリクエストを承認する

source: Accept this language suggestion
ja: この言語の提案を受け入れる

source: Acceptable characters:
ja: 許可される文字

source: Accessibility
ja: アクセシビリティ

source: Accessibility Settings
ja: アクセシビリティの設定

source: Account
ja: アカウント

source: Account Muted
ja: ミュート中のアカウント

source: Account Muted by List
ja: リストによってミュート中のアカウント

source: Account blocked
ja: アカウントをブロックしました

source: Account followed
ja: アカウントをフォローしました

source: Account muted
ja: アカウントをミュートしました

source: Account options
ja: アカウントオプション

source: Account portability is a major reason why we chose to build a separate protocol. We consider portability to be crucial because it protects users from sudden bans, server shutdowns, and policy disagreements. Our solution for portability requires both [signed data repositories](/guides/data-repos) and [DIDs](/guides/identity), neither of which are easy to retrofit into ActivityPub. The migration tools for ActivityPub are comparatively limited; they require the original server to provide a redirect and cannot migrate the user's previous data.
ja: アカウントのポータビリティは、新しいプロトコルを構築することを選択した主な理由です。ポータビリティは、突然のBAN、サーバーのシャットダウン、ポリシーの不一致からユーザーを保護するため、非常に重要であると考えています。ポータビリティのソリューションには、[署名付きデータリポジトリ](/guides/data-repos)と[DID](/guides/identity)の両方が必要ですが、どちらもActivityPubに後から簡単に組み込むことはできません。ActivityPubの移行ツールは比較的制限されており、元のサーバーがリダイレクトを提供する必要があり、ユーザーの以前のデータを移行することはできません。

source: Account provider
ja: アカウントプロバイダー

source: Account removed from quick access
ja: クイックアクセスからアカウントを解除

source: Account suspension works similarly to deactivation.
ja: アカウント凍結はアカウント無効化と同じように働きます。

source: Account takedowns work similarly to account deletion.
ja: アカウント停止はアカウント削除と同じように働きます。

source: Account unblocked
ja: アカウントのブロックを解除しました

source: Account unfollowed
ja: アカウントのフォローを解除しました

source: Account unmuted
ja: アカウントのミュートを解除しました

source: Accounts with a scalloped blue check mark <0><1/></0> can verify others. These trusted verifiers are selected by Bluesky.
ja: スカラップ状（帆立貝の形状）の青色のチェックマーク <0><1/></0> のあるアカウントは他のユーザを認証できます。これらの信頼できる認証者はBlueskyによって選択されています。

source: Activity from others
ja: 他のユーザーからのアクティビティ

source: Activity notifications
ja: アクティビティの通知

source: Add
ja: 追加

source: Add App Password
ja: アプリパスワードを追加

source: Add Reaction
ja: リアクションを追加

source: Add a content warning
ja: コンテンツの警告を追加

source: Add a description to every `main` schema definition (records, API endpoints, etc)
ja: すべての`main`スキーマ定義（レコード、APIエンドポイントなど）にdescriptionを追加してください

source: Add a temporary live status to your profile. When someone clicks on your avatar, they’ll see information about your live event.
ja: プロフィールに一時的なライブステータスを追加します。アバターをクリックすると、ライブイベントに関する情報が表示されます。

source: Add a user to this list
ja: リストにユーザーを追加

source: Add account
ja: アカウントを追加

source: Add alt text
ja: ALTテキストを追加

source: Add alt text (optional)
ja: ALTテキストを追加（オプション）

source: Add another account
ja: 他のアカウントを追加

source: Add another post
ja: 他の投稿を追加

source: Add another post to thread
ja: スレッドに他の投稿を追加

source: Add app password
ja: アプリパスワードを追加

source: Add descriptions to potentially ambiguous fields and properties. This is particularly important for fields with generic names like `uri` or `cid`: CID of what?
ja: 曖昧性のあるフィールドとプロパティにdescriptionを追加してください。これは`uri`や`cid`のような一般的な名前を持つフィールドに特に重要です（何のCIDですか？）。

source: Add emoji reaction
ja: 絵文字リアクションを追加

source: Add image
ja: 画像を追加

source: Add media to post
ja: 投稿にメディアを追加する

source: Add more details (optional)
ja: 詳細を追加（オプション）

source: Add mute word with chosen settings
ja: 選択した設定でミュートワードを追加

source: Add muted words and tags
ja: ミュートするワードとタグを追加

source: Add people
ja: ユーザーを追加

source: Add people to list
ja: リストにユーザーを追加する

source: Add recommended feeds
ja: おすすめのフィードを追加

source: Add some feeds to your starter pack!
ja: あなたのスターターパックにフィードをいくつか追加してください！

source: Add the Feed Generator server logic to `src/index.ts`:
ja: `src/index.ts`にフィードジェネレーターサーバーのロジックを追加します。

source: Add the default feed of only people you follow
ja: フォローしているユーザーのみのデフォルトのフィードを追加

source: Add the following DNS record to your domain:
ja: 次のDNSレコードをドメインに追加してください：

source: Add this feed to your feeds
ja: このフィードをあなたのフィードに追加する

source: Add this script to `package.json`:
ja: このスクリプトを`package.json`に追加します。

source: Add those command line scrips to `package.json`:
ja: これらのコマンドラインスクリプトを`package.json`に追加します。

source: Add to lists
ja: リストに追加

source: Add to saved posts
ja: 保存済投稿へ追加

source: Add to starter packs
ja: スターターパックへ追加

source: Add user to list
ja: リストにユーザーを追加

source: Add your birthdate
ja: 生年月日を追加

source: Add {0} more to continue
ja: 続けるにはさらに{0}ユーザー追加してください

source: Add {displayName} to starter pack
ja: {displayName}をスターターパックに加える

source: Added to list
ja: リストに追加

source: Added to starter pack
ja: スターターパックへ追加しました

source: Additional details (limit 1000 characters)
ja: 追加の詳細（1000文字まで）

source: Additional details (limit 300 characters)
ja: 追加の詳細（300文字まで）

source: Adult
ja: 成人向け（ポルノ等）

source: Adult Content
ja: 成人向けコンテンツ

source: Adult Content labels
ja: 成人向けコンテンツのラベル

source: Adult content
ja: 成人向けコンテンツ

source: Adult content can only be enabled via the Web at <0>bsky.app</0>.
ja: 成人向けコンテンツは<0>bsky.app</0>のウェブ版からしか有効にできません。

source: Adult content is disabled.
ja: 成人向けコンテンツは無効になっています。

source: Adult sexual abuse content
ja: 成人向けの性的虐待コンテンツ

source: Advanced
ja: 高度な設定

source: After [authenticating](/guides/reads-and-writes#creating-a-client), you'll be able to make other API requests.
ja: [認証](/guides/reads-and-writes#creating-a-client)後に、他のAPIリクエストを実行できるようになります。

source: After [authenticating](/guides/sdk-auth#creating-a-client), you'll be able to make other API requests.
ja: [認証](/guides/sdk-auth#creating-a-client)後に、他のAPIリクエストを実行できるようになります。

source: After a successful upload, blobs are placed in temporary storage. They are not accessible for download or distribution while in this state. Servers should "garbage collect" (delete) un-referenced temporary blobs after an appropriate time span (see implementation guidelines below). Blobs which are in temporary storage should not be included in the **`listBlobs`** output.
ja: アップロードに成功した後、blobは一時ストレージに配置されます。この状態では、ダウンロードや配送はできません。サーバーは適切な時間経過後に、参照されていない一時blobをガベージコレクション（削除）すべきです（後述の実装ガイドラインを参照）。一時ストレージのblobは **`listBlobs`** の出力に含められません。

source: After a user approves the authorization consent screen, they'll be redirected to a callback route. Here, you'll exchange the code from the redirect for actual credentials, then set a cookie for the user's DID. Create `app/oauth/callback/route.ts`:
ja: ユーザーが同意画面で認可を許可すると、コールバックルートへリダイレクトされます。ここでリダイレクトで受け取ったコードを実際の認証情報に交換し、ユーザーDIDのクッキーを設定します。`app/oauth/callback/route.ts`を作成してください。

source: After completing the server-side installation, you can access the Ozone web interface by navigating to your server's IP address or domain name in a web browser:
ja: サーバー側のインストールが完了したら、ウェブブラウザーでサーバーのIPアドレスまたはドメイン名でOzoneウェブインターフェースにアクセスできます。

source: After publishing a new Lexicon, you can verify that it is live with `goat lex resolve`:
ja: 新しいLexiconを公開したら、`goat lex resolve`で公開されたか確認できます。

source: After that, you can clone down our original [feed-generator repo](https://github.com/bluesky-social/feed-generator) and run the [publishFeedGen.ts](https://github.com/bluesky-social/feed-generator/blob/main/scripts/publishFeedGen.ts) script interactively. This creates the necessary Atproto records to point to your feed server, and allow it to be discovered:
ja: その後、公式の[feed-generatorリポジトリ](https://github.com/bluesky-social/feed-generator)をクローンし、[publishFeedGen.ts](https://github.com/bluesky-social/feed-generator/blob/main/scripts/publishFeedGen.ts)スクリプトを対話的に実行できます。これにより、あなたのフィードサーバーを指すために必要なatprotoレコードが作成され、発見可能になります。

source: Age Assurance
ja: 年齢保証

source: Age assurance inquiry failed to send, please try again.
ja: 年齢保証の問い合わせに失敗しました。もう一度お試しください。

source: Age assurance inquiry was submitted
ja: 年齢保証の問い合わせが送られました

source: Age assurance only takes a few minutes
ja: 年齢保証には数分かかります

source: All
ja: すべて

source: All Lexcions should be flexible to extension and evolution over time, without breaking the Lexicon schema evolution rules. This is particularly true for record schemas. Given the distributed storage model of atproto, developers do not have a reliable mechanism to update all data records in the network. Extensions could come from the original designer, or other developers and projects.
ja: すべてのLexiconはスキーマの進化ルールを破らない範囲で拡張と進化に柔軟であるべきです。これは特にレコードスキーマに当てはまります。atprotoの分散ストレージモデルを考えると、開発者はネットワーク内のすべてのデータレコードを更新するための確実なメカニズムを持ちません。拡張は元の設計者または他の開発者やプロジェクトから来ることがあります。

source: All accounts have been followed!
ja: すべてのアカウントをフォローしました！

source: All friends followed!
ja: すべての友達をフォローしました！

source: All languages
ja: すべての言語

source: All of these factors required new tools and architectures for building services. An overview of these techniques is maybe best captured in Martin Kleppman's book “Designing Data Intensive Applications”. While no two platforms are built exactly the same and there are many competing tools and methodologies, we can still sum up the general trends.
ja: これらの要因は、サービス構築のための新しいツールやアーキテクチャを必要としました。これらの技法の概観は、Martin Kleppmanの著書『Designing Data Intensive Applications』に最もよくまとめられているかもしれません。プラットフォームはそれぞれ異なり、競合するツールや手法も多いものの、それでも一般的な傾向をまとめることはできます。

source: All set! You can Ctrl+C the dev server if it's running, then start it again with:
ja: 以上です。開発サーバーが起動中ならCtrl+Cで停止し、次で再起動します。

source: All the feeds you've saved, right in one place.
ja: 保存されたすべてのフィードを1箇所にまとめます。

source: Allow access to your direct messages
ja: ダイレクトメッセージへのアクセスを許可

source: Allow anyone to reply
ja: 誰でも返信を許可

source: Allow location access
ja: 位置情報へのアクセスを許可

source: Allow new messages from
ja: 新しいメッセージを誰から受け取れるか：

source: Allow others to be notified of your posts
ja: 他のユーザーにあなたの投稿の通知を許可する

source: Allow people you follow to reply
ja: フォローしている人に返信を許可

source: Allow people you mention to reply
ja: メンションした人に返信を許可

source: Allow quote posts
ja: 引用を許可

source: Allow users in {0} to reply
ja: {0}のユーザーに返信を許可

source: Allow your followers to reply
ja: フォロワーに返信を許可

source: Allows access to direct messages
ja: ダイレクトメッセージへのアクセスを許可

source: Almost there. Add the `ai` import to your `src/index.ts` file:
ja: あと少しです。`src/index.ts`に`ai`のimportを追加します。

source: Already have a code?
ja: コードをすでに持っていますか？

source: Already have an account?
ja: 既にアカウントを持ってますか？

source: Already signed in as @{0}
ja: @{0}としてすでにサインイン済み

source: Alt Text
ja: ALTテキスト

source: Alt text
ja: ALTテキスト

source: Alt text describes images for blind and low-vision users, and helps give context to everyone.
ja: ALTテキストは、すべての人が文脈を理解できるようにするために、視覚障害者や低視力者向けに提供する画像の説明文です。

source: Alt text will be truncated. {MAX_ALT_TEXT, plural, other {Limit: {0} characters.}}
ja: ALTテキストは切り詰められます。{MAX_ALT_TEXT, plural, other {制限：{0}文字。}}

source: Although some of our internal heuristics are private, Osprey and Ozone are designed to be deployed and run by other app hosts with their own custom rules and moderation practices, whether they are reimplementing the Bluesky Lexicon and feature set or running a different kind of Atmosphere app with a different set of content.
ja: 内部のヒューリスティックの一部は非公開ですが、OspreyとOzoneは、Bluesky Lexiconと機能セットを再実装する場合でも、別種のAtmosphereアプリとして異なるコンテンツセットで運用する場合でも、独自のルールとモデレーション運用を持つ他のアプリホストが導入・運用できるように設計されています。

source: An App View is the piece that actually assembles your feed and all the other data you see in the app, and is downstream from a Relay's firehose of data. This is a semantically-aware service that produces aggregations across the network and views over some subset of the network. For example, the Relay might crawl to grab data such as a certain post's likes and reposts, and the app view will output the count of those metrics.
ja: AppViewは、アプリで見るフィードやその他すべてのデータを実際に組み立てる部分で、リレーのfirehoseデータの下流に位置します。これはセマンティクスに基づくサービスで、ネットワーク全体にわたる集計や、ネットワークの一部に対するビューを生成します。例えば、リレーが特定の投稿のいいねやリポストなどのデータをクロールして取得し、AppViewがそれらの指標のカウントを出力します。

source: An AppView is an application in the [Atmosphere](#atmosphere). It's called an "AppView" because it's just one view of the network. The canonical data lives in [data repos](#data-repo) which is hosted by [PDSes](#pds-personal-data-server), and that data can be viewed many different ways.
ja: AppViewは[Atmosphere](#atmosphere)内のアプリケーションです。ネットワークの一つのビューにすぎないため、「AppView」と呼ばれます。正規データは、[PDS](#pds-personal-data-server)によってホストされる[データリポジトリ](#data-repo)に保存され、そのデータはさまざまな方法で表示できます。

source: An email has been sent to {0}. It includes a confirmation code which you can enter below.
ja: メールが{0}に送信されました。以下に入力できる確認コードがそのメールに記載されています。

source: An error has occurred
ja: エラーが発生しました

source: An error occurred
ja: エラーが発生しました

source: An error occurred while compressing the video.
ja: ビデオの圧縮中にエラーが発生しました。

source: An error occurred while fetching suggested accounts.
ja: オススメアカウントの取得中にエラーが発生しました。

source: An error occurred while fetching the feed.
ja: フィードの取得中にエラーが発生しました。

source: An error occurred while generating your starter pack. Want to try again?
ja: スターターパックの生成中にエラーが発生しました。もう一度試しますか？

source: An error occurred while hiding suggestion. {0}
ja: 提案を非表示中にエラーが発生しました。{0}

source: An error occurred while loading the video. Please try again later.
ja: ビデオの読み込み時にエラーが発生しました。時間をおいてもう一度お試しください。

source: An error occurred while loading the video. Please try again.
ja: ビデオの読み込み時にエラーが発生しました。もう一度お試しください。

source: An error occurred while loading your lists :/
ja: リストの読み込み中にエラーが発生しました :/

source: An error occurred while saving the QR code!
ja: QRコードの保存中にエラーが発生しました！

source: An error occurred while trying to follow all
ja: すべてフォローしようとしたらエラーが発生しました

source: An error occurred while uploading the video.
ja: ビデオのアップロード中にエラーが発生しました。

source: An error occurred. {0}
ja: エラーが発生しました。{0}

source: An example set of content security headers for this endpoint is:
ja: このエンドポイントのコンテンツセキュリティヘッダーの例は次の通りです。

source: An illustration depicting user avatars flowing from a contact book into the Bluesky app
ja: 連絡帳からBlueskyアプリに流れるユーザーのアバターを描いたイラスト

source: An illustration of several Bluesky posts alongside repost, like, and comment icons
ja: リポスト、いいね、そしてコメントのアイコンと一緒に並んだいくつかのBlueskyの投稿のイラスト

source: An illustration showing that Bluesky selects trusted verifiers, and trusted verifiers in turn verify individual user accounts.
ja: Blueskyが信頼された認証者を選択し、信頼された認証者が個々のユーザアカウントを認証することを示す図。

source: An issue not included in these options
ja: ほかの選択肢にはあてはまらない問題
